fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ВКМ_ОбслуживаниеКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Формирует (или находит уже существующие) реализации по остаткам выполненных работ
// за указанный период по всем действующим абонентским договорам.
//
// Параметры:
//  Параметры - Структура - параметры выполнения длительной операции:
//   * АдресРезультата  - Строка - адрес временного хранилища для результата
//   * Период           - Дата   - дата, по которую формируются акты (обычно конец месяца)
//
Процедура СформироватьАкты(Параметры) Экспорт
	
	АдресРезультата = Параметры.АдресРезультата;
	Период          = Параметры.Период;
	
	// Все договора с видом "ВКМ_АбонентскоеОбслуживание" Действующие на дату("Период")
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И &Период МЕЖДУ ДоговорыКонтрагентов.ВКМ_ДатаНачала И ДоговорыКонтрагентов.ВКМ_ДатаОкончания";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	ТаблицаДоговоров = Запрос.Выполнить().Выгрузить();
	ВсегоДоговоров   = ТаблицаДоговоров.Количество();
	
	Если ВсегоДоговоров = 0 Тогда
		ДлительныеОперации.СообщитьПрогресс(0, "Нет действующих абонентских договоров с остатком к оплате");
		ПоместитьВоВременноеХранилище(Новый Массив, АдресРезультата);
		Возврат;
	КонецЕсли;
	// Все договора с видом "ВКМ_АбонентскоеОбслуживание" Действующие на дату("Период")
	
	// Запрос существующих реализаций где договор В &ТаблицаДоговоров и дата реализации в месяце &Периода
	ЗапросСуществующие = Новый Запрос;
	ЗапросСуществующие.Текст =
	"ВЫБРАТЬ
	|	Реализация.Договор КАК Договор,
	|	Реализация.Ссылка  КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реализация
	|ГДЕ
	|	Реализация.Проведен
	|	И Реализация.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
	|	И Реализация.Договор В (&ТаблицаДоговоров)";
	
	ЗапросСуществующие.УстановитьПараметр("Период", Период);
	ЗапросСуществующие.УстановитьПараметр("ТаблицаДоговоров", ТаблицаДоговоров.ВыгрузитьКолонку("Договор"));
	
	СоответствиеРеализаций = Новый Соответствие;
	Выборка = ЗапросСуществующие.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеРеализаций.Вставить(Выборка.Договор, Выборка.Ссылка);
	КонецЦикла;
	// Запрос существующих реализаций где договор В &ТаблицаДоговоров и дата реализации в месяце &Периода
	
	Результат = Новый Массив;
	Создано   = 0;
	Номер     = 0;
	
	Для Каждого СтрокаДоговора Из ТаблицаДоговоров Цикл
		Номер = Номер + 1;
		Процент = Окр(Номер * 100 / ВсегоДоговоров, 0);
		
		ТекстПрогресса = СтрШаблон("Обработка договора %1 из %2 (%3)…",
			Номер, ВсегоДоговоров, СтрокаДоговора.Договор);
		
		ДлительныеОперации.СообщитьПрогресс(Процент, ТекстПрогресса);
		РеализацияСсылка = СоответствиеРеализаций[СтрокаДоговора.Договор];
		
		Если НЕ ЗначениеЗаполнено(РеализацияСсылка) Тогда
			Попытка
				Док = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				Док.Дата        = Период;
				Док.Организация = СтрокаДоговора.Организация;
				Док.Контрагент  = СтрокаДоговора.Контрагент;
				Док.Договор     = СтрокаДоговора.Договор;
				
				Док.Заполнить(Неопределено);
				Док.ВыполнитьАвтозаполнение(); // ← здесь всё ещё запрос, но это уже логика самого документа
				
				Если Док.ПроверитьЗаполнение() Тогда
					Док.Записать(РежимЗаписиДокумента.Проведение);
					РеализацияСсылка = Док.Ссылка;
					Создано = Создано + 1;
				Иначе
					Продолжить;
				КонецЕсли;
			Исключение
				ИнфоОбОшибке = ИнформацияОбОшибке();
				ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
				
				ЗаписьЖурналаРегистрации(
					"МассовоеСозданиеАктов.ОшибкаПроведения",
					УровеньЖурналаРегистрации.Ошибка,
					,
					,
					ТекстОшибки);
				Продолжить;
			КонецПопытки;
		КонецЕсли;
				
		Если ЗначениеЗаполнено(РеализацияСсылка) Тогда
			Результат.Добавить(Новый Структура("Договор, Реализация",
				СтрокаДоговора.Договор, РеализацияСсылка));
		КонецЕсли;
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		ДлительныеОперации.СообщитьПрогресс(100, "Реализации не созданы и не найдены");
	Иначе
		ТекстИтог = СтрШаблон("Готово. Обработано договоров: %1, создано новых: %2, всего актов: %3",
			ВсегоДоговоров, Создано, Результат.Количество());
		ДлительныеОперации.СообщитьПрогресс(100, ТекстИтог);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти
